{"What crops is this useful for?": "This product is useful for established turfgrass species including bentgrass fairways, fescues, Kentucky bluegrass, perennial ryegrass, tall fescue, bahiagrass, Bermudagrass, centipedegrass, St. Augustinegrass, and zoysiagrass.", "First aid information?": "If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing eye. Call a poison control center or doctor for treatment advice. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. Call a poison control center or doctor for treatment advice.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is extremely toxic to freshwater, marine, and estuarine fish and aquatic invertebrates, including shrimp and oyster. It should not be applied in a manner which will directly expose canals, lakes, streams, ponds, marshes or estuaries to aerial drift. It should not be applied directly to water, or to areas where surface water is present or to intertidal areas below the mean high water mark. It should not contaminate water when disposing of equipment washwater or rinsate.", "What PPE should I wear?": "All loaders, applicators, and other handlers must wear: long-sleeved shirt and long pants, shoes plus socks, chemical-resistant gloves made of any waterproof material, goggles or faceshield.", "How, where, and on what crop should I use the product? How much is okay?": "The product is a granular fertilizer containing Team, a preemergence herbicide for application to established turfgrass for control of annual bluegrass, smooth and hairy crabgrass, goosegrass, barnyardgrass and green and yellow foxtail. It should be applied 1 to 2 weeks prior to the germination of annual grass weeds. For cool season turfgrass, apply 130 to 200 lb/acre for summer annual grass weeds and 130 to 174 lb/acre for winter annual grass weeds. For warm season turfgrass, apply 260 lb/acre.", "How does the product have to be stored or disposed?": "The product should be stored in its original container. In case of leak or spill, contain material and dispose as waste. Wastes resulting from the use of this product must be disposed of on site or at an approved waste disposal facility. The container should not be reused or refilled. It should be triple rinsed or pressure rinsed promptly after emptying.", "Is this product banned in any region?": ""}