{"What crops is this useful for?": "This product is useful for established turfgrass species including cool season turfgrass like bentgrass fairways, fescues, Kentucky bluegrass, perennial ryegrass, and tall fescue, and warm season turfgrass like bahiagrass, Bermudagrass, centipedegrass, St. Augustinegrass, and zoysiagrass.", "First aid information?": "If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing eye. Call a poison control center or doctor for treatment advice. If on skin or clothing, take off contaminated clothing. Rinse skin immediately with plenty of water for 15-20 minutes. Call a poison control center or doctor for treatment advice.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is extremely toxic to freshwater, marine, and estuarine fish and aquatic invertebrates, including shrimp and oyster. It should not be applied in a manner which will directly expose canals, lakes, streams, ponds, marshes or estuaries to aerial drift. It should not be applied directly to water, or to areas where surface water is present or to intertidal areas below the mean high water mark. It should not contaminate water when disposing of equipment washwater or rinsate. Drift and runoff may be hazardous to aquatic organisms in water adjacent to treated areas.", "What PPE should I wear?": "All loaders, applicators, and other handlers must wear: Long-sleeved shirt and long pants, Shoes plus socks, Chemical-resistant gloves made of any waterproof material, Goggles, faceshield or safety glasses.", "How, where, and on what crop should I use the product? How much is okay?": "This product is a granular fertilizer containing Team, a preemergence herbicide for application to established turfgrass for control of annual bluegrass, smooth and hairy crabgrass, goosegrass, barnyardgrass and green and yellow foxtail. It should be applied 1 to 2 weeks prior to the germination of annual grass weeds. It can be applied in split applications. The maximum single application rate is 255 lb of Turf Fertilizer – Contains Team 0.92% per acre for cool season turf and 326 lb of Turf Fertilizer – Contains Team 0.92% per acre for warm season turf.", "How does the product have to be stored or disposed?": "The product should be stored in its original container only. In case of leak or spill, the material should be contained and disposed as waste. Wastes resulting from the use of this product must be disposed of on site or at an approved waste disposal facility. The container should not be reused or refilled. It should be triple rinsed or pressure rinsed promptly after emptying.", "Is this product banned in any region?": ""}