{"What crops is this useful for?": "The text does not provide information on specific crops the pesticide is useful for.", "First aid information?": "If in eyes, rinse slowly and gently with water for 15-20 minutes. If swallowed, sip a glass of water if able to swallow. Do not induce vomiting unless told by a Poison Control Center or doctor. If inhaled, remove person to fresh air. If on skin or clothing, rinse skin immediately with plenty of water for 15-20 minutes. In case of emergency, call Chemtrec toll free at 800-424-9300.", "What special restrictions are placed on this product to protect the environment?": "The product is toxic to fish, aquatic invertebrates, marine/estuarine organisms and wildlife. It should not be applied directly to water or to areas where surface water is present or to intertidal areas below the mean high-water mark. It is known to leach through soil into groundwater under certain conditions. It can contaminate surface water through spray drift. It should not be discharged into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit.", "What PPE should I wear?": "Long-sleeve shirt and long pants, socks and shoes, goggles or face shield, chemical resistant gloves made of or such as any waterproof material, and an organic vapor (OV) removing cartridge with a prefilter approved for pesticides (MSHA/NIOSH approval number prefix TC023C), or a canister approved for pesticides (MSHA/NIOSH approval number prefix TC-14G), or a NIOSH approved respirator with an organic vapor (OV) cartridge or canister with any N, P, R, or HE prefilter. Handlers participating in hand-dip applications must also wear chemical-resistant full-front aprons with attached full-sleeved gloves.", "How, where, and on what crop should I use the product? How much is okay?": "The product is used as a protective fungicide on freshly-cut lumber and wood products for use in making particle boards. It can be applied to freshly sawn lumber, dry or partially seasoned wood, and wood products for use in making particle boards. The application rates vary depending on the method of application, ranging from 1/2 to 2 gallons NeXgen to 100 gallons of vat water for bulk dip vats, 1/2 to 1 gallons of NeXgen to 20 gallons of vat water for non-bulk vats, and 1/4 to 1 gallon of NeXgen to 20 gallons of water for low volume spray machines.", "How does the product have to be stored or disposed?": "The product should be stored away from food or feed in a secure, well-ventilated area protected from extreme temperatures. Do not transfer to unmarked containers. Keep container closed when not in use. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide or rinsate is a violation of Federal Law. If these wastes cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": "The text does not provide information on whether the product is banned in any region."}