{"What crops is this useful for?": "The pesticide is not recommended for use on croplands. It is intended for non-cropland areas such as railroad rights-of-way and industrial areas.", "First aid information?": "In case of contact with eyes, rinse immediately with plenty of water and seek medical advice. If swallowed, call a poison control center or doctor immediately for treatment advice. Have the person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a poison control center or doctor.", "What special restrictions are placed on this product to protect the environment?": "The product should not be applied directly to water, or to areas where surface water is present, or to intertidal areas below the mean high water mark. It should not contaminate water when disposing of equipment wash waters or rinseate. It is also subject to restrictions in certain parts of California, Oregon, and Washington.", "What PPE should I wear?": "Long-sleeved shirt, long pants, shoes plus socks, and chemical resistant gloves made of any waterproof material such as polyethylene or polyvinylchloride. Applicators using tractor drawn spreaders and all loaders must wear a NIOSH-approved respirator with a dust/mist filter.", "How, where, and on what crop should I use the product? How much is okay?": "The product should be applied to non-cropland areas such as railroad rights-of-way and industrial areas. It should be applied at the rate of 100 to 300 pounds per acre; on smaller plots, 0.25 to 0.75 pound per 100 square feet. The maximum rate per application is 12.0 pounds diuron active ingredient per acre in areas of high rainfall or dense vegetation, and 8.0 pounds diuron active ingredient per acre in all other areas.", "How does the product have to be stored or disposed?": "The product should be stored in its original container, away from other pesticides, fertilizer, food, or feed. Wastes resulting from the use of this product may be disposed of on site or at an approved waste disposal facility. The container should be completely emptied into application equipment, then disposed of in a sanitary landfill, by incineration, or by burning if allowed by state and local authorities.", "Is this product banned in any region?": "The use of this product is subject to restrictions in certain parts of California, Oregon, and Washington due to the January 22, 2004 Order for injunctive relief in Washington Toxics Coalition. et. al. v. EP. COI-0132C, (W.O. WA)."}