{"What crops is this useful for?": "The text does not specify any particular crops that this pesticide is useful for. It is mentioned that the product is intended for total vegetation control and is extremely active, capable of killing trees, shrubs, and other forms of vegetation.", "First aid information?": "If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If swallowed, call a poison control center or doctor immediately for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a poison control center or doctor.", "What special restrictions are placed on this product to protect the environment?": "The product is toxic to plants and may impact non-target organisms. It should not be applied to water, areas where surface water is present, or to intertidal areas below the mean high-water mark. It should not be used in areas where the water table is shallow, such as marshy or sub irrigated areas, or areas immediately adjacent to streams or lakes which are periodically flooded, unless such use is allowed under a state-approved pesticide management program.", "What PPE should I wear?": "Applicators and other handlers must wear a long-sleeved shirt and long pants, shoes plus socks, and chemical resistant gloves made of: barrier laminate, butyl rubber ≥14 mils, nitrile rubber ≥14 mils, neoprene rubber ≥14 mils, natural rubber ≥14 mils, polyethylene, polyvinyl chloride ≥14 mils, or viton ≥14 mils.", "How, where, and on what crop should I use the product? How much is okay?": "The product is intended for total vegetation control and is extremely active. It should not be applied on or near field crops. The maximum label rate and frequency of application is 40 lbs. (2 lbs. A.I.) SpraKil S -5 per acre once every three years for vulnerable areas. For all other areas, Sprakil S -5 may be applied one time in a 3-year period at a rate of up to 80 lbs. (4 lbs. A.I.) per acre of product.", "How does the product have to be stored or disposed?": "The product should be stored in its original container only, away from other pesticides, fertilizer, food, or feed. Wastes resulting from the use of this product may be disposed of on site or at an approved waste disposal facility. The container should not be reused or refilled, and should be offered for recycling if available or disposed of in a sanitary landfill, or by incineration.", "Is this product banned in any region?": ""}