{"What crops is this useful for?": "", "First aid information?": "If on skin or clothing, take off contaminated clothing and rinse skin with plenty of water for 15-20 minutes. If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. If swallowed, immediately call a poison control center or doctor for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a poison control center or doctor.", "What special restrictions are placed on this product to protect the environment?": "Do not apply directly to water, to areas where surface water is present or to intertidal areas below the mean high water mark. Do not contaminate water when disposing of equipment washwaters or rinsate. In case of spills, collect, cover or incorporate granules/pellets spilled on the soil surfaces to prevent contamination of water. Apply this product only as specified on this label.", "What PPE should I wear?": "Long-sleeved shirt and long pants; shoes plus socks; and chemical-resistant gloves made of any waterproof material such as polyethylene or polyvinylchloride. In addition, applicators using tractor drawn spreaders and all loaders must wear a NIOSH-approved particulate filtering respirator equipped with N, R, or P class filter media.", "How, where, and on what crop should I use the product? How much is okay?": "Use only for general weed control on non-cropland areas around buried cable closures, telephone booths, cross-connect boxes, transformer pads and fireplugs. Apply this product at the rate of 3.67 to 7.34 oz. per 100 square feet. Repeat spot treatment may be required when deep-rooted perennial weeds are present. Maximum rate per application: 7.34 oz. of product per 100 sq. ft. in areas of high rainfall or dense vegetation; 4.9 oz. of product per 100 sq. ft. in all other areas. Apply a maximum of 2 applications per year with a minimum retreatment interval of 90 days.", "How does the product have to be stored or disposed?": "Store in a dry area where the bag [container] is not likely to come in contact with moisture. Do not store near fertilizers, seeds, insecticides or fungicides. Wastes resulting from the use of this product may be disposed of on site or at an approved waste disposal facility. Do not reuse or refill this container. Completely empty container by shaking and tapping sides and bottom to loosen clinging particles. Empty residue into application equipment. Offer for recycling or reconditioning, or puncture and dispose of in a sanitary landfill, or by other procedures approved by State and local authorities.", "Is this product banned in any region?": "Use of this product in certain portions of California, Oregon, and Washington is subject to the January 22,2004 Order of injunctive relief in Washington Toxics Coalition, et. al. v EP, C01-0132C, (W.D. WA)."}