{"What crops is this useful for?": "", "First aid information?": "In case of emergency, call the 24-hour medical emergency number. If swallowed, sip a glass of water if able to swallow. Do not induce vomiting unless told to by a Poison Control Center or doctor. If in eyes, rinse slowly and gently with water for 15-20 minutes. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If inhaled, move person to fresh air.", "What special restrictions are placed on this product to protect the environment?": "The product should not be carelessly spilled or applied to farmland or growing plants, including trees and shrubs, as it may kill or seriously retard plant growth. It is toxic to fish and wildlife. Do not contaminate water by cleaning of equipment or disposal of wastes. Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit.", "What PPE should I wear?": "Long-sleeve shirt and long pants, shoes plus socks, protective eyewear, chemical resistant gloves, and a respirator with a dust/mist removing cartridge in accordance with NIOSH Guidelines: 42 CFR Part 84 when occupational exposure limits (OSHA PELs) are exceeded.", "How, where, and on what crop should I use the product? How much is okay?": "The product is used for the protection and treatment of wood, wood products, and wood-foam composite structural components that are protected from excessive amounts of liquid water and are not in direct contact with soil. The product is effective against decay fungi and wood boring beetles. The exact amount to use is not specified in the provided text.", "How does the product have to be stored or disposed?": "The product should be stored in a dry place, out of reach of children or animals. Wastes resulting from the use of this product may be disposed of on site or at an approved waste disposal facility. The container should not be reused or refilled, and should be disposed of in a sanitary landfill or by incineration, or if allowed by state and local authorities, by burning.", "Is this product banned in any region?": ""}