{"What crops is this useful for?": "This pesticide is useful for Tobacco, Potatoes, Onions, Ivy, Ornamentals, Shrubs, Trees and Turfgrass. It can also be used on Fallowland to control Silverleaf nightshade and Red rice.", "First aid information?": "If swallowed, call a poison control center or doctor immediately for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a poison control center or doctor. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15 to 20 minutes.", "What special restrictions are placed on this product to protect the environment?": "Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Avoid contact with eyes, skin, or clothing. Wash hands thoroughly before eating, drinking, chewing gum, using tobacco, or using the toilet.", "How, where, and on what crop should I use the product? How much is okay?": "This product is for use by Pesticide Formulators Only. It can be formulated into a plant growth regulator or a herbicide for use on Tobacco, Potatoes, Onions, Ivy, Ornamentals, Shrubs, Trees and Turfgrass, and on Fallowland to control Silverleaf nightshade and Red rice. The exact amount to use is not specified in the provided text.", "How does the product have to be stored or disposed?": "Store away from food and feedstuffs. Pesticide wastes are toxic and must be disposed of properly. If these wastes cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency or the Hazardous Waste Representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": ""}