{"What crops is this useful for?": "", "First aid information?": "If swallowed, call a Poison Control Center or doctor immediately for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a Poison Control Center or doctor. Do not give anything by mouth to an unconscious person. If you suspect a reaction to this product, discontinue use, take off contaminated clothing, and rinse skin immediately with plenty of water for 15-20 minutes. Call a Poison Control Center or doctor for treatment advice.", "What special restrictions are placed on this product to protect the environment?": "The product contains no CFC's or other ozone-depleting substances. Federal regulations prohibit CFC propellants in aerosols.", "What PPE should I wear?": "", "How, where, and on what crop should I use the product? How much is okay?": "The product is for outdoor use only. Do not spray in enclosed areas. Hold can 6 - 8 inches from skin and clothing while spraying, keeping sprayer pointed away from face. Slightly moisten skin. Use just enough repellent to cover exposed skin and/or clothing. Do not use under clothing. Do not spray directly onto face. Spray on hands first, and then apply sparingly to face, avoiding eyes. Do not apply near eyes and mouth. Apply sparingly around ears. Do not apply over cuts, wounds or irritated skin. Do not apply to sunburned skin. Do not apply to children’s hands. Do not allow children to handle this product. When using on children, apply to your own hands and then put it on the child.", "How does the product have to be stored or disposed?": "Store the product in a cool, dry place, out of reach of children. If empty, do not puncture or incinerate the nonrefillable container. Do not reuse or refill this container. Offer for recycling, if available. If partly filled, call your local solid waste agency for disposal instructions. Never place unused product down any indoor or outdoor drain.", "Is this product banned in any region?": ""}