{"What crops is this useful for?": "", "First aid information?": "IF IN EYES: Rinse with water for 15 to 20 minutes. IF ON SKIN OR CLOTHING: Rinse skin immediately with plenty of water for 15 to 20 minutes. IF SWALLOWED: Call poison control center or doctor immediately for treatment advice. IF INHALED: Move person to fresh air. If person is not breathing call 911 or an ambulance then give artificial respiration.", "What special restrictions are placed on this product to protect the environment?": "Do not apply directly to water, to areas where surface water is present or to intertidal areas below the mean high water mark. Do not contaminate water used by wildlife or aquatic life, or for domestic and irrigation purposes. Do not apply where run-off is likely or where weather conditions favor movement away from target areas.", "What PPE should I wear?": "Coveralls over long-sleeved shirt and long pants, Chemical-resistant gloves made of any waterproof material, Chemical-resistant footwear plus socks, Goggles or face shield, A dust/mist filtering respirator, Chemical-resistant headgear for overhead exposure, and Chemical-resistant apron when loading or cleaning equipment.", "How, where, and on what crop should I use the product? How much is okay?": "Use BareSpot® Weed & Grass anytime during the growing season. Apply with a hand-operated spreader, such as a conventional cyclone type spreader or a power spreader for larger areas. The maximum application rate for Diuron is 12.0 pounds active ingredient per acre in areas of high rainfall or dense vegetation. The maximum application rate for Diuron is 8.0 pounds of active ingredient in all other areas. Do not apply more than 12 pounds of Diuron active ingredient per acre per year. Apply a maximum of 2 applications per year. The minimum retreatment interval is 90 days.", "How does the product have to be stored or disposed?": "Avoid contact with floor and moisture. Wastes resulting from the use of this product may be disposed of on-site or at an approved waste disposal facility. Empty product from bag before disposal. Dispose of bag in a sanitary landfill or by incineration or allowed by State and local authorities by burning.", "Is this product banned in any region?": ""}