{"What crops is this useful for?": "The pesticide is useful for roses, ornamentals, vegetables and fruits such as asparagus, beans, currants, gooseberries, peaches, peas, grapes, apples, pears, cherries, fresh plums, citrus fruits, and tomatoes. It can also be used for soil correction for azaleas, camellias, heather, rhododendrons, and other acid-loving plants.", "First aid information?": "", "What special restrictions are placed on this product to protect the environment?": "For terrestrial uses, do not apply directly to water, to areas where surface water is present or to intertidal areas below the mean high water mark. Do not contaminate water when disposing of rinsate or equipment washwater. Apply this product only as specified on this label.", "What PPE should I wear?": "Avoid contact with skin, eyes, and clothing. Avoid breathing dust or spray mist. Wash thoroughly with soap and water after handling. Remove contaminated clothing and wash before reuse.", "How, where, and on what crop should I use the product? How much is okay?": "The product can be used as a liquid spray or a dust. For one gallon of spray, mix the recommended dosage rate of the pesticide with an equal amount of water and stir into a thick paste, then add water slowly, stirring constantly until the gallon of water has been thoroughly combined. Apply with an ordinary sprayer. Keep well stirred at all times. The product is ready to use as it comes in the package for dusting. Apply early in the morning or in the cool of the evening when the air is still. Thoroughly cover all stems, leaves, and blossoms on both upper and lower surfaces. As a fungicide, applications should begin when diseases begin to appear. During the summer and fall applications should be made at 10 day intervals. As an insecticide, apply carefully when the insects threaten and repeat every few days until the pests are eliminated.", "How does the product have to be stored or disposed?": "Store in original container in a locked storage area inaccessible to children or pets. Securely wrap original container in several layers of newspaper and discard in trash. Do not reuse container. Rinse thoroughly before discarding in trash.", "Is this product banned in any region?": ""}