{"What crops is this useful for?": "The product is not intended for use on crops, timber, or other plants being grown for sale or other commercial use, or for commercial seed production, or for research purposes. It is intended for use around any property or facility that functions to provide a service to the public or to public or private organizations.", "First aid information?": "First aid instructions are provided for different scenarios: If swallowed, do not induce vomiting unless told to do so by a poison control center or doctor. If on skin or clothing, rinse skin immediately with plenty of water for 15-20 minutes. If in eyes, rinse slowly and gently with water for 15-20 minutes. If inhaled, move the person to fresh air and give artificial respiration if necessary.", "What special restrictions are placed on this product to protect the environment?": "The product should not be applied directly to water, or to areas where surface water is present, or to intertidal areas below the mean high water mark. It should not be used in areas where soils are permeable, particularly where the water table is shallow, as it may result in groundwater contamination. The product should not be applied under circumstances where spray drift may occur to food, forage, or other plantings that might be damaged.", "What PPE should I wear?": "The PPE section specifies that all loaders, applicators and other handlers must wear a long-sleeved shirt and long pants, shoes and socks, chemical-resistant gloves, and a chemical-resistant apron when loading, cleaning up spills or cleaning equipment.", "How, where, and on what crop should I use the product? How much is okay?": "The product is intended for use on non-crop and non-timber areas only. It should be applied undiluted as a spray on non-cropland areas where bare ground is desired. The degree of weed control and duration of effect will vary with the amount of product used, soil type, rainfall and other conditions. It can be applied any time of year except when the ground is frozen. More than two broadcast applications per site per year are prohibited.", "How does the product have to be stored or disposed?": "The product should not be stored with fertilizers, seeds, insecticides or fungicides. It should not contaminate water, food or feed by storage or disposal or cleaning of equipment. Open dumping is prohibited. Pesticide wastes are toxic and if they cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": ""}