{"What crops is this useful for?": "", "First aid information?": "IF IN EYES: Hold eyes open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing. Call a poison control center or doctor for treatment advice. IF SWALLOWED: Call a poison control center or doctor immediately for treatment advice. Have person sip a glass of water If able to swallow. Do not induce vomiting unless told by a poison control center or doctor. Do not give anything by mouth to an unconscious person. IF ON SKIN: Take off contaminated clothing. Rinse skin immediately with plenty of water for 15-20 minutes. Call a poison control center or doctor for treatment advice. IF INHALED: Move person to fresh air. If person is not breathing, call 911 or an ambulance, then give artificial respiration, preferably mouth-ta-mouth, if possible. Call a poison control center or doctor for treatment advice.", "What special restrictions are placed on this product to protect the environment?": "This product is toxic to fish and wildlife. Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans, or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent containing this product to sewer systems without previously notifying the sewage treatment plant authority.", "What PPE should I wear?": "Wear goggles, safety glasses or face shield when handling. Avoid contact with skin. Do not breathe vapor or spray mist dust.", "How, where, and on what crop should I use the product? How much is okay?": "Tektamer 38 A.D. Is typically effective when applied at the concentrations shown. All concentrations are based on total formulation weight. It can be used on Aqueous Paints, Latex Emulsions, Adhesives, Polyvinyl acetate, styrene-butadiene, methyl cellulose & acrylic, Polyvinyl alcohol & hydroxyethyl cellulose, Epoxy, polyester, Dextrin, Casein, Starch, Dispersed Pigments, Metalworking Fluids, Waxes & Polishes, Inks, Joint Cements, Fiber Processing Fluids, Concrete and Concrete Admixtures.", "How does the product have to be stored or disposed?": "Do not contaminate water, food, or feed by storage or disposal. PESTICIDE STORAGE: Wastes resulting from use of this product may be disposed of on site or at an approved waste disposal facility. PESTICIDE DISPOSAL: Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide, spray mixture or rinsate is a violation of Federal Law. If these wastes cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA regional Office for guidance. CONTAINER HANDLING: Non-refillable container. Do not reuse or refill this container. Offer for recycling if available or reconditioning if appropriate. Triple rinse (or equivalent). Then offer for recycling or reconditioning, or puncture and dispose of in a sanitary landfill, or, if allowed by state and local authorities, by burning. If burned, stay out of smoke.", "Is this product banned in any region?": ""}