{"What crops is this useful for?": "", "First aid information?": "If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after 5 minutes, then continue rinsing. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If swallowed, immediately call a poison control center or doctor. Do not induce vomiting unless told to do so by a poison control center or doctor. If inhaled, move person to fresh air. If person is not breathing call 911 or an ambulance, then give artificial respiration preferably mouth-to-mouth if possible.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is toxic to fish and aquatic organisms. Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Wear goggles, faceshield or safety glasses, protective clothing and rubber gloves.", "How, where, and on what crop should I use the product? How much is okay?": "The product is used in aqueous systems such as latex paints, wood products, cutting oils, oleo-resinous paints, and textiles. The application rates vary depending on the use. For paints, use 0.6-2.0%. For wood, use 0.1-3.0%. For cutting oils, use 0.1-1.0%. For textiles, use 0.2-2.0%. For PVC plastics, use 1.0-4.0%. For non-food use agricultural products, use 0.2-1.0%.", "How does the product have to be stored or disposed?": "The material has a tendency to crystallize at low temperatures. Storage temperatures below 90F (32C) and above 32F (0C) are suggested. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticides, spray mixture, or rinsate is a violation of Federal Law. If these wastes cannot be disposed of by use according to label instructions, contact your State pesticide or environmental control agency or the hazardous waste representative at the nearest EPA regional office for guidance.", "Is this product banned in any region?": ""}