{"What crops is this useful for?": "", "First aid information?": "If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If swallowed, call a poison control center or doctor immediately for treatment advice. If inhaled, move person to fresh air and if person is not breathing call 911 or an ambulance, then give artificial respiration.", "What special restrictions are placed on this product to protect the environment?": "This product is toxic to fish and aquatic organisms. Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Applicators and other handlers must wear long sleeved shirts, long pants, chemical-resistant gloves and shoes plus socks.", "How, where, and on what crop should I use the product? How much is okay?": "The product is used in various applications such as adhesives, caulks, canvas and cordage, cutting oils, grouts, inks, oleo-resinous and latex paints, paper coatings, plastics, textiles, wood products, home care cleaning products including floor cleaners, laundry additives including liquid laundry detergents, fabric softeners, and stain removers, polishes and surface cleaners and waxes. The use levels vary for each application and field trials are suggested to determine the most cost effective use level.", "How does the product have to be stored or disposed?": "The material has a tendency to pack into hard lumps due to its low melting point. Storage temperatures below 90ºF (32ºC) and above 32ºF (0ºC) are suggested. Pesticide wastes are acutely hazardous. Do not contaminate water when disposing of equipment washwaters. Improper disposal of excess pesticides, spray mixture, or rinsate is a violation of federal law.", "Is this product banned in any region?": ""}