{"What crops is this useful for?": "This product may only be used in rangelands, pastures, croplands and non-crop areas. It is not to be applied directly to food or feed crops.", "First aid information?": "If swallowed, call a physician or poison control center immediately. If inhaled, remove victim to fresh air. If in eyes, flush with steady, gentle stream of water for 15 minutes. If on skin, wash with plenty of soap and water. Administer 100% oxygen by positive pressure and anticonvulsant drugs intravenously to control convulsions if necessary.", "What special restrictions are placed on this product to protect the environment?": "This product is toxic to fish, birds and other wildlife. It should not be exposed on soil surface, applied directly to water, or to areas where surface water is present. It should not be used in the geographic ranges of certain endangered species except under programs and procedures approved by the U.S. EPA.", "What PPE should I wear?": "Applicators and other handlers must wear a long-sleeved shirt and pants, cotton gloves, shoes plus socks, and a minimum of a NIOSH-approved particulate filtering facepiece respirator with any R or P filter.", "How, where, and on what crop should I use the product? How much is okay?": "This product is used to control pocket gophers in subterranean applications only in rangelands, pastures, croplands and non-crop areas. It should not be applied above ground over agricultural crops or anywhere else. One pound of bait will treat 1-8 acres, depending upon number of burrow systems to be treated.", "How does the product have to be stored or disposed?": "Store in original container in a dry place, in a locked area out of reach of children. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide, spilled bait, or rinsate is a violation of Federal Law. The container is non-refillable and should not be reused or refilled. It should be offered for recycling, if available, or disposed of in a sanitary landfill or by burning, if allowed by State and local authorities.", "Is this product banned in any region?": ""}