{"What crops is this useful for?": "", "First aid information?": "If in eyes, rinse slowly and gently with water for 15-20 minutes. If inhaled, move person to fresh air. If swallowed, have person sip a glass of water if able to swallow. Do not induce vomiting unless told by a Poison Control Center or doctor. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is toxic to fish. Do not apply directly to water, or to areas where surface water is present or to intertidal areas below the mean high water mark. Do not contaminate water by disposal of equipment wash waters.", "What PPE should I wear?": "Applicators and other handlers must wear goggles, chemical-resistant gloves (such as water proof material) and protective clothing (long-sleeved shirt and long pants, shoes plus socks) when applying or handling freshly treated lumber.", "How, where, and on what crop should I use the product? How much is okay?": "This product can be used for all suitable above ground applications. Use on cedar, redwood, pressure-treated and most other woods. Do not apply over hardboard or particle board. Do not use on wood that will be in contact with food, feed or potable water, or where prolonged skin contact is expected. Coverage ranges from 150-300 sq. ft. per gallon depending on wood porosity, surface texture, and dryness of wood.", "How does the product have to be stored or disposed?": "Close container tightly and store upright to prevent leakage. Do not store near excessive heat, sparks or flames. Avoid storage near feed or food products. Keep from freezing. If empty, do not reuse or refill this container. Place in trash or offer for recycling, if available. If partly filled, call your local solid waste agency for disposal instructions. Never place unused product down any indoor or outdoor drain.", "Is this product banned in any region?": ""}