{"What crops is this useful for?": "The product is intended for use on ornamentals only. It can be used on hardwood, semi-hardwood, softwood, and succulents. Examples include deciduous plants, broadleaf and needle evergreens, Juniper, Yew, Dogwood, Azalea, Photina, Rhododendron, Magnolia, Cactus, Fuchsia, Begonia, and ice plant.", "First aid information?": "If the product comes into contact with skin or clothing, rinse skin immediately with plenty of water for 15-20 minutes and remove contaminated clothing. If it gets in the eyes, rinse slowly and gently with water for 15-20 minutes. If swallowed, call a poison control center or doctor immediately. If inhaled, move the person to fresh air and call a poison control center or doctor for further treatment advice.", "What special restrictions are placed on this product to protect the environment?": "The product should not be applied directly to water, areas where surface water is present, or to intertidal areas below the mean high water mark. It should not contaminate water when disposing of equipment washwaters. Effluent containing this product should not be discharged into lakes, streams, ponds, estuaries, oceans, or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit.", "What PPE should I wear?": "All mixers, applicators and other handlers must wear a long-sleeved shirt and long pants, chemical-resistant gloves such as barrier laminate, butyl rubber, nitrile-rubber, neoprene rubber, polyvinyl chloride or viton, and shoes plus socks.", "How, where, and on what crop should I use the product? How much is okay?": "The product should be used on ornamentals only. It should be mixed only for immediate use and used within 10 hours. For hardwood cuttings, mix 1 part Dip’N Grow to 5 parts water. For medium hardwood cuttings, mix 1 part Dip’N Grow to 10 parts water. For softwood cuttings and succulents, mix 1 part Dip’N Grow to 20 parts water. Dip the basal end of cuttings only, individually or in bunches for 3 to 5 seconds, then immediately place cuttings into planting media.", "How does the product have to be stored or disposed?": "The product should be stored in its original container in a cool, dry place, out of the reach of children, preferably in a locked storage cabinet. It should be protected from freezing. Pesticide wastes are toxic and should be disposed of according to label instructions or by contacting your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": ""}