{"What crops is this useful for?": "", "First aid information?": "In case of contact with eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing eye. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If swallowed, call a poison control center or doctor immediately for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by the poison control center or doctor. If inhaled, move person to fresh air. If person is not breathing, call 911 or an ambulance, then give artificial respiration, preferably by mouth-to-mouth, if possible.", "What special restrictions are placed on this product to protect the environment?": "This product is toxic to fish. Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans, or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority. For guidance, contact your State Water Board or Regional Office of the EPA. Do not apply directly to water, or to areas where surface water is present or to intertidal areas below the mean high water mark. Do not contaminate water when disposing of equipment washwaters or rinsate.", "What PPE should I wear?": "Applicators and other handlers must wear: long-sleeve shirt and long pants, chemical-resistant gloves such as rubber or any waterproof material, shoes plus socks, goggles or face shield.", "How, where, and on what crop should I use the product? How much is okay?": "Dantogard Plus Industrial Preservative is used to control bacterial and fungal growth in liquid detergents, fabric softeners, household cleaning products, soft soaps, water-based paints for households and industrial use, room deodorizers and air fresheners, water-based surfactants, polymer emulsions, protective or decorative coatings, water-based gels for household and industrial products, textiles, water-based adhesives, sealants and caulks, latex for paper coatings, and water-based inks. It must be added to the formulation to be preserved at a rate of 0.1-0.3 lbs. per 100 lbs. or 0.1-0.3% or 1-3 lbs. per 1000 lbs. based upon the total weight of the product to be protected.", "How does the product have to be stored or disposed?": "Store in a dry place. Do not store at elevated temperatures. Keep from freezing. Keep container closed. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide, spray mixture, or rinsate is a violation of Federal Law. If these wastes cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": "The product is not approved for use in California for metalworking fluid preservation."}