{"What crops is this useful for?": "", "First aid information?": "If in Eyes: Rinse with water for 15-20 minutes. Remove contact lenses after the first 5 minutes, then continue rinsing. If on Skin or Clothing: Take off contaminated clothing. Rinse skin with plenty of water for 15-20 minutes. If Inhaled: Move person to fresh air. If person is not breathing, call 911 or an ambulance, then give artificial respiration. If Swallowed: Call a poison control center or doctor immediately. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is toxic to fish and aquatic organisms. Do not discharge effluent containing this product into lakes, ponds, streams, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Users must wear goggles or face shield, long sleeved shirt, long pants, chemical-resistant gloves and shoes plus socks.", "How, where, and on what crop should I use the product? How much is okay?": "For manufacturing use only in the formulation of end use products in the following applications: Solvent and waterborne based paints, stains, & latex emulsions; Aqueous metalworking, cutting, cooling, and lubricating fluids and concentrates; Aqueous, solvent & non-solvent based systems such as natural and synthetic adhesives, caulks, patching compounds, sealants, grouts, latexes; Plastic items; Aqueous and solvent based coatings or dyes which are applied to paper and cardboard substrates; Aqueous based ink solutions; Wood preservation for above ground application.", "How does the product have to be stored or disposed?": "Storage temperatures below 90°F (32°C) and above 32°F (0°C) are suggested. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide, spray mixture, or rinsate is a violation of Federal Law. If these wastes cannot be disposed of by use according to label instructions contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": ""}