{"What crops is this useful for?": "", "First aid information?": "If swallowed, have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by the poison control center or doctor. Do not give anything by mouth to an unconscious person. If in eyes, hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing eye. If on skin or clothing, take off contaminated clothing and rinse skin immediately with plenty of water for 15-20 minutes. If inhaled, move person to fresh air. If person is not breathing, call 911 or an ambulance, then give artificial respiration, preferably mouth-to-mouth, if possible.", "What special restrictions are placed on this product to protect the environment?": "Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Wear goggles or face shield. Wear protective clothing and rubber gloves.", "How, where, and on what crop should I use the product? How much is okay?": "The product is used for bar and restaurant cold water glasswashing and foodservice utensil cleaning and sanitizing. For glasswashing, adjust pump to deliver the proper amount of titratable iodine (12.5 ppm = 1 oz. Saniphor No. 240 to 10 gal water) and verify concentration. For utensil cleaning, sanitize in a solution of 1 oz. of product to 5 gallons of water by immersing for one minute (25 ppm titratable iodine).", "How does the product have to be stored or disposed?": "Store this product in a cool dry area, away from direct sunlight and heat to avoid deterioration. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide spray mixture or rinsate is a violation of Federal law. If these wastes cannot be disposed of by use according to label instructions, contact your State Pesticide or Environmental Control Agency, or the Hazardous Waste representative at the nearest EPA Regional Office for guidance.", "Is this product banned in any region?": ""}