{"What crops is this useful for?": "", "First aid information?": "If swallowed: Call a Poison Control Center or doctor immediately for treatment advice. Have person sip a glass of water if able to swallow. Do not induce vomiting unless told to do so by a poison control center or doctor. Do not give anything by mouth to an unconscious person. If in Eyes: Hold eye open and rinse slowly and gently with water for 15-20 minutes. Remove contact lenses, if present, after the first 5 minutes, then continue rinsing the eye. Call a Poison Control Center or doctor for treatment advice. If on Skin or clothing: Take off contaminated clothing. Rinse skin immediately with plenty of water for 15-20 minutes. Call a Poison Control center or doctor for treatment advice.", "What special restrictions are placed on this product to protect the environment?": "Do not discharge effluent containing this product into lakes, streams, ponds, estuaries, oceans or other waters unless in accordance with the requirements of a National Pollutant Discharge Elimination System (NPDES) permit and the permitting authority has been notified in writing prior to discharge. Do not discharge effluent. containing this product to sewer systems without previously notifying the local sewage treatment plant authority.", "What PPE should I wear?": "Wear protective gloves when applying Impel Rods.", "How, where, and on what crop should I use the product? How much is okay?": "", "How does the product have to be stored or disposed?": "Store in dry conditions at all times and out of the reach of children. Wastes resulting from the use of this product may be disposed of on site or at an approved disposal facility. For plastic containers, offer for recycling if available or reconditioning if appropriate or puncture and dispose of in a sanitary landfill or by other procedures approved by state and local authorities. For cardboard containers, offer for recycling if available or puncture and dispose of in a sanitary landfill, or by incineration, or, if allowed by state and local authorities.", "Is this product banned in any region?": ""}