{"What crops is this useful for?": "The product is not used for crops but is effective on softwoods including Douglas fir, White fir, Spruce, Hemlock, the Pines including both the Southern and Western Yellow Pines, Eastern and Western White Pines and many of the hardwoods.", "First aid information?": "If in eyes, rinse slowly and gently with water for 15 to 20 minutes. If on skin or clothing, rinse skin immediately with plenty of water for 15 to 20 minutes. If swallowed, do not induce vomiting unless told to do so by a poison control center or doctor. If inhaled, move person to fresh air. For medical emergencies call your poison control center at 1-800-222-1222.", "What special restrictions are placed on this product to protect the environment?": "This pesticide is toxic to fish. Do not apply directly to water. Do not contaminate water when disposing equipment wastewaters. Treated lumber must be stored under cover, or indoors, or at least 100 feet from any pond, lake, stream, wetland, or river to prevent possible runoff of the product into the water way.", "What PPE should I wear?": "Wear synthetic rubber gloves or plastic coated gloves in handling solutions and freshly treated lumber. Also wear coveralls worn over long-sleeved shirt, long pants, chemical resistant footwear plus socks, a chemical-resistant apron, goggles and if splashing is possible, face shield, barrier laminate, nitrile rubber or Viton gloves, and a NOISH approved respirator.", "How, where, and on what crop should I use the product? How much is okay?": "The product is not used for crops but for lumber. Lumber and logs should be totally immersed or sprayed so as to ensure all surfaces are treated. For high pressure spray applications, mix one gallon of NP-1® Sapstain Control Chemical per 15 to 50 gallons of water. For dip applications, mix one gallon of NP-1® Sapstain Control Chemical per 40 to 300 gallons of water.", "How does the product have to be stored or disposed?": "Store in a closed, properly labeled container in a cool place. If static generating conditions exist, provide necessary grounding and bonding. Keep containers closed when not in use. Pesticide wastes are acutely hazardous. Improper disposal of excess pesticide, spray mixture, or rinsate is a violation of Federal law.", "Is this product banned in any region?": ""}