{"What crops is this useful for?": "The pesticide is useful for Drybeans, Southern peas (cowpeas, field peas, black-eyed peas), Snap-beans, Lima beans, Okra and transplants of Tomatoes, Peppers, Broccoli, Brussels Sprouts, Cabbage, Cauliflower. It is also recommended for use on established Ornamental Shrubs and Trees and certain flowers including Ageratum, Aster, Balsam, Calendula, California Poppy, Calliopsis, Carnation, Cosmos, Daffodils, Dahlia, Forget-Me-Not, Four-O’Clocks, Gaillardia, Gladiolus, Hollyhock, Lobelia, Marigold, Morning Glory, Nasturtium, Periwinkle, Petunia, Portulaca, Shasta Daisy, Snapdragon, Stocks, Sunflower, Sweet Alyssum, Sweet Pea, Tulips, Zinnia.", "First aid information?": "If in eyes, rinse slowly and gently with water for 15-20 minutes. If swallowed, call a poison control center or doctor immediately. If on skin, rinse skin immediately with plenty of water for 15-20 minutes. If inhaled, move person to fresh air and call a poison control center or doctor for further treatment advice.", "What special restrictions are placed on this product to protect the environment?": "The pesticide is extremely toxic to freshwater, marine, and estuarine fish and aquatic invertebrates. It should not be applied in a manner which will expose canals, lakes, streams, ponds, marshes, or estuaries to aerial drift. It should not be allowed to enter or run off into storm drains, drainage ditches, gutters or surface waters.", "What PPE should I wear?": "The text does not provide specific information on what Personal Protective Equipment (PPE) should be worn when handling this pesticide.", "How, where, and on what crop should I use the product? How much is okay?": "The product should be applied on garden areas being prepared for subsequent planting, first loosen soil thoroughly, remove all visible weeds and smooth surface. Apply this product at the recommended rate over the surface uniformly, and rake or spade the product into the soil to a depth of 2 to 3 inches. On established plantings, remove all visible weeds, and then apply this product at the recommended rate uniformly over the soil surface. Rake the product into the soil, being careful not to disturb the established plants or roots. The product must be soil-incorporated within 24 hours of application either by at least 0.5 acre inch of water (rainfall, irrigation) or mechanical incorporation.", "How does the product have to be stored or disposed?": "The product should be stored in its original container in a cool, dry, locked place out of the reach of children and animals. If the container is empty, it should not be reused or refilled and should be placed in trash or offered for recycling if available. If partly filled, call your local solid waste agency for disposal instructions.", "Is this product banned in any region?": "The text does not provide information on whether this product is banned in any region."}